Revit 2027 API
BuiltInFailures.AutoRouteFailures.ZeroLengthSegmentWarning Property
 The solution is failing to do segments which are zero length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ZeroLengthSegmentWarning { get; }
Public Shared ReadOnly Property ZeroLengthSegmentWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ZeroLengthSegmentWarning {
	FailureDefinitionId^ get ();
}
static member ZeroLengthSegmentWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace